KozhinovAlexander/qnx8-bsp-stm32mp257f-dk/bsp/qnx800.bsp.hw.st_stm32mp257f-dk/bsp/BSP_st-stm32mp257f-dk_be-800/src/hardware/startup/lib/public/soc/st/stm32mp2/include/stm32mp2_uart.h
/*
 * Copyright (c) 2021-2022, STMicroelectronics - All Rights Reserved
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef STM32_UART_H
#define STM32_UART_H

#include <soc/st/stm32mp2/include/stm32mp2_uart_regs.h>

/* UART word length */
#define STM32_UART_WORDLENGTH_7B		STM32_USART_CR1_M1
#define STM32_UART_WORDLENGTH_8B		0x00000000U
#define STM32_UART_WORDLENGTH_9B		STM32_USART_CR1_M0

/* UART number of stop bits */
#define STM32_UART_STOPBITS_0_5			STM32_USART_CR2_STOP_0
#define STM32_UART_STOPBITS_1			0x00000000U
#define STM32_UART_STOPBITS_1_5			(STM32_USART_CR2_STOP_0 | STM32_USART_CR2_STOP_1)
#define STM32_UART_STOPBITS_2			STM32_USART_CR2_STOP_1

/* UART parity */
#define STM32_UART_PARITY_NONE			0x00000000U
#define STM32_UART_PARITY_EVEN			STM32_USART_CR1_PCE
#define STM32_UART_PARITY_ODD			(STM32_USART_CR1_PCE | STM32_USART_CR1_PS)

/* UART transfer mode */
#define STM32_UART_MODE_RX			STM32_USART_CR1_RE
#define STM32_UART_MODE_TX			STM32_USART_CR1_TE
#define STM32_UART_MODE_TX_RX			(STM32_USART_CR1_TE | STM32_USART_CR1_RE)

/* UART hardware flow control */
#define STM32_UART_HWCONTROL_NONE		0x00000000U
#define STM32_UART_HWCONTROL_RTS		STM32_USART_CR3_RTSE
#define STM32_UART_HWCONTROL_CTS		STM32_USART_CR3_CTSE
#define STM32_UART_HWCONTROL_RTS_CTS		(STM32_USART_CR3_RTSE | STM32_USART_CR3_CTSE)

/* UART prescaler */
#define STM32_UART_PRESCALER_DIV1		0x00000000U
#define STM32_UART_PRESCALER_DIV2		0x00000001U
#define STM32_UART_PRESCALER_DIV4		0x00000002U
#define STM32_UART_PRESCALER_DIV6		0x00000003U
#define STM32_UART_PRESCALER_DIV8		0x00000004U
#define STM32_UART_PRESCALER_DIV10		0x00000005U
#define STM32_UART_PRESCALER_DIV12		0x00000006U
#define STM32_UART_PRESCALER_DIV16		0x00000007U
#define STM32_UART_PRESCALER_DIV32		0x00000008U
#define STM32_UART_PRESCALER_DIV64		0x00000009U
#define STM32_UART_PRESCALER_DIV128		0x0000000AU
#define STM32_UART_PRESCALER_DIV256		0x0000000BU
#define STM32_UART_PRESCALER_NB			0x0000000CU

/* UART fifo mode */
#define STM32_UART_FIFOMODE_EN			STM32_USART_CR1_FIFOEN
#define STM32_UART_FIFOMODE_DIS			0x00000000U

/* UART TXFIFO threshold level */
#define STM32_UART_TXFIFO_THRESHOLD_1EIGHTHFULL		0x00000000U
#define STM32_UART_TXFIFO_THRESHOLD_1QUARTERFUL		STM32_USART_CR3_TXFTCFG_0
#define STM32_UART_TXFIFO_THRESHOLD_HALFFULL		STM32_USART_CR3_TXFTCFG_1
#define STM32_UART_TXFIFO_THRESHOLD_3QUARTERSFULL	(STM32_USART_CR3_TXFTCFG_0 | STM32_USART_CR3_TXFTCFG_1)
#define STM32_UART_TXFIFO_THRESHOLD_7EIGHTHFULL		STM32_USART_CR3_TXFTCFG_2
#define STM32_UART_TXFIFO_THRESHOLD_EMPTY		(STM32_USART_CR3_TXFTCFG_2 | STM32_USART_CR3_TXFTCFG_0)

/* UART RXFIFO threshold level */
#define STM32_UART_RXFIFO_THRESHOLD_1EIGHTHFULL		0x00000000U
#define STM32_UART_RXFIFO_THRESHOLD_1QUARTERFULL	STM32_USART_CR3_RXFTCFG_0
#define STM32_UART_RXFIFO_THRESHOLD_HALFFULL		STM32_USART_CR3_RXFTCFG_1
#define STM32_UART_RXFIFO_THRESHOLD_3QUARTERSFULL	(STM32_USART_CR3_RXFTCFG_0 | STM32_USART_CR3_RXFTCFG_1)
#define STM32_UART_RXFIFO_THRESHOLD_7EIGHTHFULL		STM32_USART_CR3_RXFTCFG_2
#define STM32_UART_RXFIFO_THRESHOLD_FULL		(STM32_USART_CR3_RXFTCFG_2 | STM32_USART_CR3_RXFTCFG_0)

#endif /* STM32_UART_H */
